In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [8]:
titanic_df =  pd.read_csv("Titanic.csv")

In [9]:
titanic_df.shape

(891, 12)

In [10]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [17]:
titanic_df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

More Femail than Male on boarded

In [18]:
titanic_df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [22]:
titanic_df.groupby('Survived').agg({'Sex':'value_counts'})

                 Sex
Survived Sex
0        male    468
         female   81
1        female  233
         male    109

More male were servived - 0 Survived , 1 - Not Survived

In [ ]:
## One hot encoding

In [31]:
new_df= pd.get_dummies(titanic_df,columns=['Sex','Embarked'])

In [33]:
#Reduce column with same info

In [37]:
 new_df = pd.get_dummies(titanic_df,columns=['Sex','Embarked'],drop_first=True)

In [39]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Sex_male     891 non-null    uint8
 11  Embarked_Q   891 non-null    uint8
 12  Embarked_S   891 non-null    uint8
dtypes: float64(2), int64(5), object(3), uint8(3)
memory usage: 72.3+ KB

In [42]:
from sklearn.preprocessing import LabelEncoder

In [44]:
le_encoder = LabelEncoder()

In [45]:
titanic_df['Encoder_Gender'] = le_encoder.fit_transform(titanic_df['Sex'])

In [46]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Encoder_Gender
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1

In [51]:
titanic_df['Encoded_Embark'] = le_encoder.fit_transform(titanic_df['Embarked'])

In [52]:
titanic_df['Encoded_Embark'].value_counts()

2    644
0    168
1     77
3      2
Name: Encoded_Embark, dtype: int64

In [50]:
titanic_df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)